10/data/attachments/cd7b1c4b03490879.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_3366b451-5789-4053-9ce3-aaa5786d2676</nif:username>
            <nif:friendToBeAdded>Martin_room_Friend_33604_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>